In [1]:
import acquire

import pandas as pd

from sklearn.model_selection import train_test_split
import sklearn.preprocessing

# Use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [2]:
from pydataset import data

In [3]:
df_iris = data('iris')

## print the first 3 rows

In [4]:
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

## print the number of rows and columns (shape)

In [5]:
df_iris.shape

(150, 5)

## print the column names

In [6]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

## print the data type of each column

In [7]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

## print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [8]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

I don't think it needs to be scaled.

# Read Table1_CustDetails the excel module dataset, Excel_Exercises.xlsx, into a dataframe, df_excel

In [9]:
df_excel = pd.read_excel('Spreadsheets_Exercises_Solutions.xlsx', sheet_name='Table1_CustDetails')

In [10]:
df_excel.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes

## assign the first 100 rows to a new dataframe, df_excel_sample

In [11]:
df_excel_sample = df_excel.head(100)

print the number of rows of your original dataframe

In [12]:
len(df_excel)

7049

print the first 5 column names

In [13]:
df_excel.columns.values.tolist()[0:5]

['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents']

print the column names that have a data type of object

In [14]:
df_excel.select_dtypes(include='object').columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

compute the range for each of the numeric variables.

In [15]:
df_excel.select_dtypes(include=('int64', 'float64')).columns

Index(['is_senior_citizen', 'phone_service', 'internet_service',
       'contract_type', 'monthly_charges', 'total_charges'],
      dtype='object')

In [16]:
df_excel.monthly_charges.max() - df_excel.monthly_charges.min()

100.5

In [17]:
df_excel.total_charges.max() - df_excel.total_charges.min()

8666.0

# Read the data from this google sheet into a dataframe, df_google

In [18]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google_sheet = pd.read_csv(csv_export_url)

## print the first 3 rows

In [19]:
df_google_sheet.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

## print the number of rows and columns

In [20]:
df_google_sheet.shape

(891, 12)

## print the column names

In [21]:
df_google_sheet.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

## print the data type of each column

In [22]:
df_google_sheet.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## print the summary statistics for each of the numeric variables

In [23]:
df_google_sheet.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## print the unique values for each of your categorical variables

In [24]:
df_google_sheet.Survived.unique()

array([0, 1])

In [25]:
df_google_sheet.Pclass.unique()

array([3, 1, 2])

In [26]:
df_google_sheet.Sex.unique()

array(['male', 'female'], dtype=object)

In [27]:
df_google_sheet.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

# Preparing the Data

## Iris Data

### Use the function defined in acquire.py to load the iris data.

In [28]:
iris_df = acquire.get_iris_data()
iris_df.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
0,1,1,5.1,3.5,1.4,0.2,setosa
1,1,2,4.9,3.0,1.4,0.2,setosa
2,1,3,4.7,3.2,1.3,0.2,setosa
3,1,4,4.6,3.1,1.5,0.2,setosa
4,1,5,5.0,3.6,1.4,0.2,setosa

### Split the Data

In [29]:
train, test = train_test_split(iris_df, random_state=115, train_size=.8)
train.head()

,species_id,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_name
101,3,102,5.8,2.7,5.1,1.9,virginica
103,3,104,6.3,2.9,5.6,1.8,virginica
115,3,116,6.4,3.2,5.3,2.3,virginica
54,2,55,6.5,2.8,4.6,1.5,versicolor
106,3,107,4.9,2.5,4.5,1.7,virginica

### Drop the species_id and measurement_id columns.

In [30]:
train.drop(columns=['species_id', 'measurement_id'], inplace=True)

/usr/local/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

### Rename the species_name column to just species.

In [31]:
train.rename(columns={'species_name': 'species'}, inplace=True)

/usr/local/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:4133: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,


### Encode the species name using a sklearn label encoder. Research the inverse_transform method of the label encoder. How might this be useful?

In [32]:
encoder = sklearn.preprocessing.LabelEncoder().fit(train.species)

In [33]:
df_iris['encoded'] = encoder.transform(df_iris.Species)

In [34]:
df_iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species  encoded
1           5.1          3.5           1.4          0.2  setosa        0
2           4.9          3.0           1.4          0.2  setosa        0
3           4.7          3.2           1.3          0.2  setosa        0
4           4.6          3.1           1.5          0.2  setosa        0
5           5.0          3.6           1.4          0.2  setosa        0

inverse_transform: Useful if later on we decide we do need the data returned back to it's original state

### Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [35]:
def split_data(df):
    train, test = train_test_split(df, random_state=115, train_size=.8)
    
    return train, test

In [36]:
def drop_columns(df):
    return df.drop(columns=['species_id', 'measurement_id'])

In [37]:
def rename_columns(df):
    return df.rename(columns={'species_name': 'species'})

In [38]:
def encode_column(df):
    encoder = sklearn.preprocessing.LabelEncoder().fit(df.species)
    df['encoded'] = encoder.transform(df.species)
    return df

In [39]:
def prep_iris(raw_data):
    # 1. Split the data into train/test
    train, test = split_data(raw_data)
    #2. Drop columns
    train = drop_columns(train)
    #3. Rename columns
    train = rename_columns(train)
    #4. Encode columns
    train = encode_column(train)
    
    return train, test

In [40]:
train, test = prep_iris(acquire.get_iris_data())

In [41]:
train.head()

     sepal_length  sepal_width  petal_length  petal_width     species  encoded
101           5.8          2.7           5.1          1.9   virginica        2
103           6.3          2.9           5.6          1.8   virginica        2
115           6.4          3.2           5.3          2.3   virginica        2
54            6.5          2.8           4.6          1.5  versicolor        1
106           4.9          2.5           4.5          1.7   virginica        2

## Titanic Data

### Use the function you defined in acquire.py to load the titanic data set.

In [42]:
df_titanic = acquire.get_titanic_data()

In [43]:
df_titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

### Split the Data

In [44]:
train, test = train_test_split(df_titanic, random_state=115, train_size=.8)

### Handle the missing values in the embark_town and embarked columns.

In [45]:
train.embark_town.value_counts(dropna=False)

Southampton    513
Cherbourg      138
Queenstown      59
NaN              2
Name: embark_town, dtype: int64

In [46]:
train.embark_town.fillna('Southampton', inplace=True)

/usr/local/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py:6245: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)

In [47]:
train.embarked = train.embarked.fillna('S')
train.embarked.value_counts(dropna=False)

/usr/local/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py:5303: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

S    515
C    138
Q     59
Name: embarked, dtype: int64

In [48]:
encoder = sklearn.preprocessing.OneHotEncoder(sparse=False, categories='auto')

In [49]:
train_matrix = encoder.fit_transform(train[['embark_town']])

In [50]:
train_embark = pd.DataFrame(train_matrix, columns=encoder.categories_[0], index=train.index)

In [51]:
train_embark.head()

     Cherbourg  Queenstown  Southampton
638        0.0         0.0          1.0
278        0.0         1.0          0.0
611        0.0         0.0          1.0
420        1.0         0.0          0.0
158        0.0         0.0          1.0

In [52]:
train = train.join(train_embark)

In [53]:
train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone,Cherbourg,Queenstown,Southampton
638,638,0,3,female,41.0,0,5,39.6875,S,Third,None,Southampton,0,0.0,0.0,1.0
278,278,0,3,male,7.0,4,1,29.1250,Q,Third,None,Queenstown,0,0.0,1.0,0.0
611,611,0,3,male,NaN,0,0,7.0500,S,Third,None,Southampton,1,0.0,0.0,1.0
420,420,0,3,male,NaN,0,0,7.8958,C,Third,None,Cherbourg,1,1.0,0.0,0.0
158,158,0,3,male,NaN,0,0,8.6625,S,Third,None,Southampton,1,0.0,0.0,1.0

### Remove the deck column.

In [54]:
train.drop(columns='deck', inplace=True)

In [55]:
train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,Cherbourg,Queenstown,Southampton
638,638,0,3,female,41.0,0,5,39.6875,S,Third,Southampton,0,0.0,0.0,1.0
278,278,0,3,male,7.0,4,1,29.1250,Q,Third,Queenstown,0,0.0,1.0,0.0
611,611,0,3,male,NaN,0,0,7.0500,S,Third,Southampton,1,0.0,0.0,1.0
420,420,0,3,male,NaN,0,0,7.8958,C,Third,Cherbourg,1,1.0,0.0,0.0
158,158,0,3,male,NaN,0,0,8.6625,S,Third,Southampton,1,0.0,0.0,1.0

### Use a label encoder to transform the embarked column.

In [56]:
label_encoder = sklearn.preprocessing.LabelEncoder()
train.embarked = label_encoder.fit_transform(train[['embarked']])

/usr/local/anaconda3/lib/python3.7/site-packages/sklearn/preprocessing/_label.py:251: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [57]:
train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,Cherbourg,Queenstown,Southampton
638,638,0,3,female,41.0,0,5,39.6875,2,Third,Southampton,0,0.0,0.0,1.0
278,278,0,3,male,7.0,4,1,29.1250,1,Third,Queenstown,0,0.0,1.0,0.0
611,611,0,3,male,NaN,0,0,7.0500,2,Third,Southampton,1,0.0,0.0,1.0
420,420,0,3,male,NaN,0,0,7.8958,0,Third,Cherbourg,1,1.0,0.0,0.0
158,158,0,3,male,NaN,0,0,8.6625,2,Third,Southampton,1,0.0,0.0,1.0

### Scale the age and fare columns using a min max scaler. Why might this be beneficial? When might you not want to do this?

In [61]:
train.age.isna().sum()

142

In [59]:
scaler = sklearn.preprocessing.MinMaxScaler()
train[['age','fare']] = scaler.fit_transform(train[['age','fare']])

In [60]:
train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,Cherbourg,Queenstown,Southampton
638,638,0,3,female,0.507886,0,5,0.077465,2,Third,Southampton,0,0.0,0.0,1.0
278,278,0,3,male,0.078864,4,1,0.056848,1,Third,Queenstown,0,0.0,1.0,0.0
611,611,0,3,male,NaN,0,0,0.013761,2,Third,Southampton,1,0.0,0.0,1.0
420,420,0,3,male,NaN,0,0,0.015412,0,Third,Cherbourg,1,1.0,0.0,0.0
158,158,0,3,male,NaN,0,0,0.016908,2,Third,Southampton,1,0.0,0.0,1.0

### Fill the missing values in age. The way you fill these values is up to you. Consider the tradeoffs of different methods.

### Create a function named prep_titanic that accepts the untransformed titanic data, and returns the data with the transformations above applied.\

In [65]:
def prep_titanic(df):
    # 1. Split into train/test
    train, test = train_test_split(df_titanic, random_state=115, train_size=.8)
    
    # 2. Drop Columns
    train.drop(columns='deck', inplace=True)
    
    # 3. Handling Missing Values
    train.embark_town.fillna('Southampton', inplace=True)
    train.embarked = train.embarked.fillna('S')
    
    # 4. Encode
    label_encoder = sklearn.preprocessing.LabelEncoder()
    train.embarked = label_encoder.fit_transform(train[['embarked']])
    
    encoder = sklearn.preprocessing.OneHotEncoder(sparse=False, categories='auto')
    train_matrix = encoder.fit_transform(train[['embark_town']])
    train_embark = pd.DataFrame(train_matrix, columns=encoder.categories_[0], index=train.index)
    train = train.join(train_embark)
    
    return train, test

In [68]:
train, test = prep_titanic(acquire.get_titanic_data())

/usr/local/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,
/usr/local/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py:6245: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)
/usr/local/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py:5303: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value
/usr/local/anaconda3/lib/python3.7/site-packages/sklearn/preprocessing/_label.py:251: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)